package Zadachi.Alishev.Zad10;
/**Вы можете потренироваться в добавлении значений в двоичное дерево поиска на
 этом сайте:  http://btv.melezinek.cz/binary-search-tree.html
 Теперь, в нашем дереве 4 родителя - узел 10 (для 5 и 23), узел 5 (для 1 и 6), узел 23
 (для 20) и узел 6 (для 7).
 Так как для всех родителей в этом дереве сохраняется основной закон двоичного
 дерева поиска (левый сын меньше, правый сын больше или равен), это двоичное
 дерево поиска корректное.
 Интересное свойство двоичного дерева поиска заключается в том, что поддеревья
 тоже являются двоичными деревьями поиска.*/
public class z10_1 {
}
